app/views/home/index.html.erb

	<div class="row text-center">
		<% Event.all.each do |event| %>
---
SELECT "events".* FROM "events"