app/views/event/show.html.erb

<p id="notice"><%= notice %></p>
<h1><%=Event.find(params[:id].to_i).title%> </h1>
<p><%=Event.find(params[:id].to_i).description%> </p>
<p><%=Event.find(params[:id].to_i).duration%> minutes </p>
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]