app/helpers/application_helper.rb

	def admin (event)
		@user=User.find(event.admin_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 99], ["LIMIT", 1]]