app/controllers/attendances_controller.rb

  def index
    @attendances = Attendance.all
---
SELECT "attendances".* FROM "attendances"

    def set_attendance
      @attendance = Attendance.find(params[:id])
---
SELECT  "attendances".* FROM "attendances" WHERE "attendances"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]