app/controllers/events_controller.rb

SELECT "events".* FROM "events"
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @events = Event.all
    #figure out how to find a featured event and what it is
    @event = Event.find(1)

INSERT INTO "events" ("start_date", "duration", "title", "description", "price", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @event = Event.new(event_params)

      if @event.save

UPDATE "events" SET "title" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["title", "nathantbl1@gmail.comkkk"], ["updated_at", "2019-11-05 21:59:32.151434"], ["id", 11]]
---
  def update
    respond_to do |format|
      if @event.update(event_params)