app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 99], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."admin_id" = $1  [["admin_id", 99]]
SELECT COUNT(*) FROM "events" WHERE "events"."admin_id" = $1  [["admin_id", 99]]
SELECT "events".* FROM "events" INNER JOIN "attendances" ON "attendances"."event_id" = "events"."id" WHERE (attendances.user_id = 6)
SELECT COUNT(*) FROM "events" INNER JOIN "attendances" ON "attendances"."event_id" = "events"."id" WHERE (attendances.user_id = 99)
---
  def show
    @user = User.find(params[:id])
    @admin_events = Event.where(admin_id: @user.id)
    (@admin_events.size > 0)? (@admin = true) : (@admin = false)
    @guest_events = Event.joins(:attendances).where('attendances.user_id = ?', @user.id)
    (@guest_events.size > 0)? (@guest = true) : (@guest = false)